Revit 2027 API
DuctFittingAndAccessoryConnectorData.Angle Property
 the angle of the fitting, Units:(rad).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Angle { get; }
Public ReadOnly Property Angle As Double
	Get
public:
property double Angle {
	double get ();
}
member Angle : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace